// ————————————————————————————————————————————————————————
// 학생 데이터 -> 10명
// ————————————————————————————————————————————————————————
var my_student = {
    "김군":{
        "성별": "남자",
        "나이": 26,
        "취미": "게임",
        "학교":{
            "이름":"한국대",
            "학년":"3학년",
            "전공": "경영",
            "부전공": "심리",
        }, 
        "가족 구성원": 4
    },
    "student2":{
        "이름": "최군",
        "성별": "남자",
        "나이": 25,
        "취미": "자전거",
        "학교": "한국대",
        "학년": "4학년",
        "전공": "컴퓨터",
        "부전공": "경영",
        "가족 구성원": 3
    },
    "student3":{
        "이름": "심양",
        "성별": "여자",
        "나이": 25,
        "취미": "보드",
        "학교": "한국대",
        "학년": "4학년",
        "전공": "간호",
        "부전공": "",
        "가족 구성원": 3
    },
    "student4":{
        "이름": "김양",
        "성별": "여자",
        "나이": 25,
        "취미": "",
        "학교": "한국대",
        "학년": "4학년",
        "전공": "디자인",
        "부전공": "",
        "가족 구성원": 5
    },
    "student5":{
        "이름": "이군",
        "성별": "남자",
        "나이": 24,
        "취미": "",
        "학교": "한국대",
        "학년": "4학년",
        "전공": "행정",
        "부전공": "정치외교",
        "가족 구성원": 4
    },
    "student6":{
        "이름": "최양",
        "성별": "여자",
        "나이": 25,
        "취미": "음악감상",
        "학교": "한국대",
        "학년": "4학년",
        "전공": "국어국문",
        "부전공": "행정",
        "가족 구성원": 3
    },
    "student7":{
        "이름": "전군",
        "성별": "남자",
        "나이": 25,
        "취미": "축구",
        "학교": "한국대",
        "학년": "4학년",
        "전공": "광고디자인",
        "부전공": "",
        "가족 구성원": 3
    },
    "student8":{
        "이름": "박군",
        "성별": "남자",
        "나이": 25,
        "취미": "조립",
        "학교": "한국대",
        "학년": "4학년",
        "전공": "전자",
        "부전공": null,
        "가족 구성원": 2
    },
    "student9":{
        "이름": "박양",
        "성별": "여자",
        "나이": 25,
        "취미": "노래",
        "학교": "한국대",
        "학년": "4학년",
        "전공": "불어불문",
        "부전공": "",
        "가족 구성원": 5
    },
    "student10":{
        "이름": "모양",
        "성별": "여자",
        "나이": 25,
        "취미": "봉사",
        "학교": "한국대",
        "학년": "4학년",
        "전공": "사회복지",
        "부전공": "",
        "가족 구성원": 4
    }
}


// 이름
//  성별
//  나이
//  취미
//  학교
//    이름
//    학년
//  전공
//  부전공
//  가족 구성원
//      [] or {}
